In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Student_ID': ['101', '102', '103', '104', None],
    'Age': ['20', '21', None, '22', 'twenty'],
    'Marks': [85, None, 90, '88', 92],
    'Department': ['CS', 'IT', None, 'CS', 'IT']
}

df = pd.DataFrame(data)
df

  Student_ID     Age Marks Department
0        101      20    85         CS
1        102      21  None         IT
2        103    None    90       None
3        104      22    88         CS
4       None  twenty    92         IT

In [3]:
df.head()

  Student_ID     Age Marks Department
0        101      20    85         CS
1        102      21  None         IT
2        103    None    90       None
3        104      22    88         CS
4       None  twenty    92         IT

In [4]:
df.dtypes

Student_ID    object
Age           object
Marks         object
Department    object
dtype: object

In [5]:
df.isnull()

   Student_ID    Age  Marks  Department
0       False  False  False       False
1       False  False   True       False
2       False   True  False        True
3       False  False  False       False
4        True  False  False       False

In [6]:
df.isnull().sum()

Student_ID    1
Age           1
Marks         1
Department    1
dtype: int64

In [ ]:
# Drop Rows with Missing Values
df_drop = df.dropna()
df_drop

In [ ]:
df.loc[df['Department'].isna(), 'Department'] = 'Unknown'

### Titanic datasets

# Fill Missing Age with Median

In [1]:
import pandas as pd

df = pd.read_csv("datasets/Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# Fill Missing Age with Median
median_age = df['Age'].median()

df.loc[df['Age'].isnull(), 'age'] = median_age

In [ ]:
#Fill Missing Embarked with Mode
mode_embarked = df['embarked'].mode()[0]

df.loc[df['embarked'].isnull(), 'embarked'] = mode_embarked

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
age            714
dtype: int64